
let data = [
    {
        year: 2008,
        data: [
            ['Бутусов Д.Н., Жуков К.Г', 'Программно-аппаратное тестирование дифференциальных анализаторов в среде LabVIEW', 'Образовательные, научные и инженерные приложения в среде LABVIEW и технологии National Instruments: Сборник трудов VII научно-практической конференции', 'Москва. − М.:, РУДН. − 2008. с. 31-38.', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Жуков К.Г', 'Модельное проектирование дифференциальных анализаторов на базе cRIO FPGA NI', 'Образовательные, научные и инженерные приложения в среде LABVIEW и технологии National Instruments: Сборник трудов VII научно-практической конференции', 'Москва. − М.:, РУДН. − 2008. с. 22.', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Жуков К.Г', 'Лабораторный практикум по дисциплине «Компьютерные технологии виртуализации»', 'Материалы XV международной конференции «Современное образование: содержание, технологии, качество»', 'Спб.: изд. СПБГЭТУ "ЛЭТИ". − 2008. с. 87', '', '', '', '', '', ''],
        ]
    },
    {
        year: 2009,
        data: [
            ['Бутусов Д.Н., Жуков К.Г.', 'Реализация цифровых фильтров методом совместного интегрирования', 'Научно-технические ведомости Санкт-Петербургского государственного политехнического университета', '2009. − №6. c. 26-34.', '1', '', '', '', '', ''],
            ['Бутусов Д.Н., Жуков К.Г.', 'Анализ и коррекция погрешности цифровых интеграторов встраиваемых систем управления', 'Научно-технические ведомости Санкт-Петербургского государственного политехнического университета', '2009. − №6. с. 17-25', '1', '', '', '', '', ''],
            ['Бутусов Д.Н., Узунян А.В., Константинов К.С.', 'Разработка модуля автоматизированного расчета масштабов дифференциального анализатора', 'Образовательные, научные и инженерные приложения в среде LABVIEW и технологии National Instruments: Сборник трудов VIII научно-практической конференции', 'Москва − М.:, РУДН. − 2009. с. 214-217', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Ндома М.', 'Автоматизация перехода от математического описания управляемых систем к блок-диаграмме', 'Образовательные, научные и инженерные приложения в среде LABVIEW и технологии National Instruments: Сборник трудов VIII научно-практической конференции', 'Москва − М.:, РУДН. − 2009.с. 189-191', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Константинов К.С.', 'Комплекс лабораторных работ по курсу схемотехники и микроконтроллерам с удаленным доступом', '62-я Научно-техническая конференция профессорско-преподавательского состава университета: Сборник докладов студентов, аспирантов и молодых ученых. Санкт-Петербург', 'Санкт-Петербург, 27 января-8 февраля 2009 г., Спб.: изд. СПБГЭТУ "ЛЭТИ". − 2009. с. 152', '', '', '', '', '', ''],
        ]
    },
    {
        year: 2010,
        data: [
            ['Бутусов Д. Н., Жуков К. Г', 'Коррекция погрешности решения уравнения гармонического осциллятора методом последовательного интегрирования', 'Научно-технические ведомости Санкт-Петербургского государственного политехнического университета', '2010. − №6(113). с. 135-144.', '1', '', '', '', '', ''],
            ['Бутусов Д. Н., Жуков К. Г', 'Коррекция погрешности решения дифференциальных уравнений второго порядка', 'Научно-технические ведомости Санкт-Петербургского государственного политехнического университета', '2010. − №6(113). с. 121-126', '1', '', '', '', '', ''],
            ['Бутусов Д.Н., Романов А.Е., Андреев В.С.', 'Проектирование цифровых фильтров средствами модуля NI Digital Filter Design', '63-я Научно-техническая конференция профессорско-преподавательского состава университета: Сборник докладов студентов, аспирантов и молодых ученых', 'Санкт-Петербург, 26 января-6 февраля 2010 г. − Спб.: изд. СПБГЭТУ "ЛЭТИ". − 2010.', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Жуков К.Г.', 'Реализация итеративных дифференциальных анализаторов средствами NI', 'Образовательные, научные и инженерные приложения в среде LabVIEW и технологии National Instruments: Сборник трудов IX Научно-практической конференции', 'Москва 3-4 декабря, 2010 г. − М.:, РУДН − 2010. с. 356', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Жуков К.Г., Ндома М.', 'Модуль программирования итеративного многопроцессорного дифференциального анализатора', 'Образовательные, научные и инженерные приложения в среде LabVIEW и технологии National Instruments: Сборник трудов IX Научно-практической конференции', 'Москва 3-4 декабря, 2010 г. − М.:, РУДН − 2010. с. 362.', '', '', '', '', '', ''],
        ]
    },
    {
        year: 2011,
        data: [
            ['Бутусов Д. Н., Прушенова Л.В., Решетов И.Н.', 'Коррекция погрешности моделирования динамических систем, описываемых дифференциальными уравнениями первого и второго порядка', 'Известия Санкт-Петербургского государственного электротехнического университета «ЛЭТИ»', ' − 2011. − №9. c. 109-111', '1', '1', '', '', '', ''],
            ['Бутусов Д.Н., Андреев В.С.', 'Модельное проектирование генератора гармонических сигналов на базе ПЛИС', 'Известия Санкт-Петербургского государственного электротехнического университета «ЛЭТИ»', ' − 2011. − №10. c. 55-60.', '1', '1', '', '', '', ''],
            ['Butusov D., Kostenko M., Mityakov A., Petrov D.', 'Demand prediction algorithm used in mobile device driver for cloud storage', '11th international conference on its telecommunications, ITST.', '− 2011', '', '', '', '', '10.1109/ITST.2011.6060162', '978-1-61284-671-2'],
            ['Бутусов Д.Н., Андреев В.С., Решетов И.Н., Жуков К.Г.', 'Программно-аппаратная реализация решения уравнений в частных производных', 'Инженерные, научные и образовательные приложения на базе технологий National Instruments − 2011: Сборник трудов X международной научно-практической', ' Москва 8-9 декабря 2011 г. − М.: ДМК-пресс, 2011. с. 431-432', '', '', '', '', '', ''],
        ]
    },
    {
        year: 2012,
        data: [
            ['Андреев В.С., Бутусов Д. Н.', 'Программно-аппаратные решатели уравнений в частных производных на основе метода прямых', 'Известия Санкт-Петербургского государственного электротехнического университета «ЛЭТИ»', '− 2012. − №4, с. 14-21.', '1', '1', '', '', '', ''],
            ['Бутусов Д.Н., Андреев В.С., Красильников А.В., Белов П.Е.', 'Лабораторный практикум дисциплины «Автоматизация проектирования встраиваемых систем»', 'Инженерные и научные приложения на базе технологий National Instruments − 2012: Сборник трудов XI международной научно-практической конференции', 'Москва 6-7 декабря 2012 г.− М.: ДМК Пресс, 2012, с. 173-175.', '', '', '', '', '', ''],
            ['Андреев В.С., Бутусов Д.Н.', 'Исследование погрешностей численных формул интегрирования с применением универсального интегратора', 'Инженерные и научные приложения на базе технологий National Instruments − 2012: Сборник трудов XI международной научно-практической конференции', 'Москва 6-7 декабря 2012 г.− М.: ДМК Пресс, 2012, с. 404-405.', '', '', '', '', '', ''],
        ]
    },
    {
        year: 2013,
        data: [
            ['Бутусов Д.Н., Андреев В.С., Красильников А.В.', 'Архитектура параллельных высокопроизводительных устройств обработки сигналов', 'Современные проблемы науки и образования', ' − 2013. − №5.', '1', '1', '', '', '', ''],
            ['Бутусов Д.Н., Каримов А.И., Платонов С.М., Лавров С.В., Мандра А.Г.', 'Реализация цифрового интегратора с применением дельта-преобразования', 'Современные проблемы науки и образования', '− 2013. − №1.', '1', '1', '', '', '', ''],
            ['Бутусов Д.Н., Андреев В.С., Каримов Т.И., Липкин С.М., Сотнин М.И.', 'Анализ эффективности применения дельта-преобразования при моделировании звеньев второго порядка', 'Современные проблемы науки и образования', '− 2013. − №1.', '1', '1', '', '', '', ''],
            ['Бутусов Д.Н., Андреев В.С.  Островский В.Ю.', 'Система цифровой обработки сигналов ультразвукового сонара', 'Известия Санкт-Петербургского государственного электротехнического университета «ЛЭТИ»', '− 2013. − №10. с. 16-20.', '1', '1', '', '', '', ''],
            ['Бутусов Д.Н., Красильников А.В., Райцин С.Б., Миронченко Е.А., Клунникова Ю.В.', 'Модельное проектирование системы управления шасси роботизированной платформы', 'Современные проблемы науки и образования', '− 2013. − №1', '1', '1', '', '', '', ''],
            ['Андреев В.С, Островский В.Ю, Малютин М.О.', 'Организация курса лабораторных работ по цифровой схемотехнике в среде LabVIEW', '66-я Научно-техническая конференция профессорско-преподавательского состава университета: Сборник докладов студентов, аспирантов и молодых ученых', 'Санкт-Петербург, 1–8 февраля 2013. 2013, с. 148-152.', '', '', '', '', '', ''],
            ['Малютин М.О., Андреев В.С., Бутусов Д.Н.', 'Система автоматизированного построения цифровых систем обработки сигналов с параллельной структурой', 'Инженерные и научные приложения на базе технологий National Instruments − 2013: Сборник трудов XII международной научно-практической конференции', 'Москва 28-29 ноября 2013 г. − М.: ДМК Пресс, 2013, с. 185-188.', '', '', '', '', '', ''],
            ['Островский В.Ю, Красильников А.В, Жариков А.В., Сорокин Е.В., Суворов П.А.', 'Курс лабораторных работ по виртуализации объектов робототехники', ' Инженерные и научные приложения на базе технологий National Instruments − 2013: Сборник трудов XII международной научно-практической конференции', 'Москва 28-29 ноября 2013 г. − М.: ДМК Пресс, 2013, с. 329-333.', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Андреев В.С.', 'Параллельная декомпозиция моделей динамических систем средствами MathScript RT', 'Инженерные и научные приложения на базе технологий National Instruments − 2013: Сборник трудов XII международной научно-практической конференции', 'Москва 28-29 ноября 2013 г. − М.: ДМК Пресс, 2013, с. 90-95.', '', '', '', '', '', ''],
        ]
    },
    {
        year: 2014,
        data: [
            ['Бутусов Д.Н., Каримов Т.И., Каримов А.И. .', 'Применение модифицированного дельта-преобразования при проектировании специализированных вычислителей', 'Современные проблемы науки и образования', '− 2014. − №3', '1', '1', '', '', '', ''],
            ['Бутусов Д.Н., Каримов А.И., Каримов Т.И., Долгушин Г.К.', 'Семейство аппаратно-ориентированных методов численного интегрирования', 'Современные проблемы науки и образования', '− 2014. − №4.', '1', '1', '', '', '', ''],
            ['Тутуева А.В., Бутусов Д.Н., Андреев В.С.', 'Способ оценки вычислительной эффективности решателей обыкновенных дифференциальных уравнений', 'Современные проблемы науки и образования', '− 2014. − №6.', '1', '1', '', '', '', ''],
            ['Бутусов Д.Н., Островский В.Ю., Красильников А.В.', 'Моделирование нелинейных динамических систем параллельными численными методами интегрировани', 'Фундаментальные исследования', ' − 2014. − №12/9.', '1', '1', '', '', '', ''],
            ['Каримов Т.И., Бутусов Д.Н., Каримов А.И.', 'Критерий применимости дельта-оператора при синтезе дискретных систем в форме пространства состояний', 'Фундаментальные исследования', '− 2014. − №12/9.', '1', '1', '', '', '', ''],
            ['Андреев В.С., Малютин М.О., Каримов А.И., Каримов Т.И.', 'Комплекс программных средств автоматизации проектирования цифровых систем с параллельной архитектурой', 'Инженерные и научные приложения на базе технологий NI NIDays − 2014: Сборник трудов XIII международной научно-практической конференции', 'Москва 19-20 ноября 2014 г. − М.: ДМК Пресс, 2014, с. 116 -118.', '', '', '', '', '', ''],
            ['Бутусов Д.Н.', 'Синтез и исследование аппаратно-ориентированных численных методов интегрирования в среде LabVIEW', 'Инженерные и научные приложения на базе технологий NI NIDays − 2014: Сборник трудов XIII международной научно-практической конференции', 'Москва 19-20 ноября 2014 г. − М.: ДМК Пресс, 2014, с. 209-212.', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Тутуева А.В.', 'Моделирование нестационарных динамических систем параллельными численными методами интегрирования в среде LabVIEW', 'Инженерные и научные приложения на базе технологий NI NIDays − 2014: Сборник трудов XIII международной научно-практической конференции', 'Москва 19-20 ноября 2014 г. − М.: ДМК Пресс, 2014, с. 213-216.', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Каримов А.И., Каримов Т.И.', 'Моделирование динамических систем в среде LabVIEW с применением дельта-преобразования', 'Инженерные и научные приложения на базе технологий NI NIDays − 2014: Сборник трудов XIII международной научно-практической конференции', 'Москва 19-20 ноября 2014 г. − М.: ДМК Пресс, 2014, с. 217-220', '', '', '', '', '', ''],
            ['Хомицкая Е.С., Лукин Р.О., Жариков А.В.', 'Технологии виртуализации как основа внедрения образовательной инициативы CDIO в СПБГЭТУ', 'Инженерные и научные приложения на базе технологий NI NIDays − 2014: Сборник трудов XIII международной научно-практической конференции', 'Москва 19-20 ноября 2014 г. − М.: ДМК Пресс, 2014, с 476-478.', '', '', '', '', '', ''],
        ]
    },
    {
        year: 2015,
        data: [
            ['Butusov D.N., Tutueva A.V., Ostrovskii V. Y.', 'Simulation of Dynamical Systems Based on Parallel Numerical Integration Methods', 'Proceedings of the 2015 IEEE North West Russia Section Young Researchers In Electrical and Electronic Engineering Conference', 'St. Petersburg, February 2-4, 2015, p. 56-60', '', '', '000380484800014', '2-s2.0-84933556703', '10.1109/EIConRusNW.2015.7102231', '978-147997305-7'],
            ['Andreev V.S., Butusov D.N., Karimov A.I., Karimov T.I.', 'Automated Design of Digital Systems with Parallel Architecture', 'Proceedings of the 2015 IEEE North West Russia Section Young Researchers In Electrical and Electronic Engineering Conference', 'St. Petersburg, February 2-4, 2015, p. 46-48', '', '', '000380484800012', '2-s2.0-84933533218', '10.1109/EIConRusNW.2015.7102229', '978-147997305-7'],
            ['Малютин М.О.', 'Проектирование программно-аппаратных средств для криптоанализа', '68-ая Научно-техническая конференция профессорско-преподавательского состава университета: Сборник докладов студентов, аспирантов и молодых ученых', 'Санкт-Петербург, 28 января - 5 февраля 2015 г., Спб.: изд. СПБГЭТУ "ЛЭТИ". − 2015. с. 126-128', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Каримов А.И., Андреев В.С.', 'Компьютерное моделирование хаотических систем симметричными экстраполяционными методами.', 'Сборник докладов XVIII Международной конференции по мягким вычислениям и измерениям (SCM - 2015)', '19-21 мая 2015 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2015, том 1., с. 225-229', '', '1', '', '', '', ''],
            ['Butusov D.N., Karimov A.I., Andreev V.S.', 'Computer simulation of chaotic systems with symmetric extrapolation methods', 'Soft Computing and Measurements (SCM), 2015 XVIII International Conference on', 'St. Petersburg, Russia, 19-21 May, 2015, p. 78-80', '', '', '000380607100022', '2-s2.0-84959312285', '10.1109/SCM.2015.7190416', '978-1-4673-6960-2'],
            ['Каримов Т. И., Бутусов Д. Н., Каримов А. И.', 'Сравнение аналогового и численного способов моделирования хаотических систем', 'Сборник докладов XVIII Международной конференции по мягким вычислениям и измерениям (SCM - 2015)', '19-21 мая 2015 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2015, том 1., с. 252-256', '', '1', '', '', '', ''],
            ['Karimov T.I., Butusov D.N., Karimov A.I.', 'Comparison of analog and numerical chaotic system simulation', 'Soft Computing and Measurements (SCM), 2015 XVIII International Conference on', 'St. Petersburg, Russia, 19-21 May, 2015, p. 81-83', '', '', '000380607100023', '2-s2.0-84959304742', '10.1109 / SCM.2015.7190417', '978-1-4673-6960-2'],
            ['Красильников А.В., Малютин М.О., Тутуева А.В., Горяинов С.Н.', 'Экспериментальная оценка устойчивости моделей динамических систем при малых возмущениях параметров', 'Сборник докладов XVIII Международной конференции по мягким вычислениям и измерениям (SCM - 2015)', ' 19-21 мая 2015 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2015, том 1., с. 203-206', '', '1', '', '', '', ''],
            ['Матвеева И.В., Красильников А.В., Калмычков В.А.', 'Проектирование спецификаций квантовых цепей с лексической верификацией', 'Сборник докладов XVIII Международной конференции по мягким вычислениям и измерениям (SCM - 2015)', '19-21 мая 2015 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2015, том 1., с. 199-202', '', '1', '', '', '', ''],
            ['Kalmychkov V., Krasilnikov A., Matveeva I.', 'Quantum circuits specifications design with lexical verification', 'Soft Computing and Measurements (SCM), 2015 XVIII International Conference on', 'St. Petersburg, Russia, 19-21 May, 2015, p. 87-89', '', '', '000380607100025', '2-s2.0-84959315294', '10.1109 / SCM.2015.7190419', '978-1-4673-6960-2'],
            ['Karimov A.I., Karimov T.I.', 'Dynamic system simulation using delta operator in LabVIEW environment', 'Proceedings of the 2015 International Siberian Conference on Control and Communications (SIBCON)', 'Omsk, Russia, 21-23 May, 2015', '', '', '000380571600358', '2-s2.0-84941077982', '10.1109/SIBCON.2015.7147320', '978-147997102-2'],
            ['Andreev V.S., Malyutin M.O., Karimov A.I., Karimov T.I.', 'The toolkit for automation design of digital systems with parallel architecture', 'Proceedings of the 2015 International Siberian Conference on Control and Communications (SIBCON)', 'Omsk, Russia, 21-23 May, 2015', '', '', '000380571600350', '2-s2.0-84941038402', '10.1109/SIBCON.2015.7147312', '978-147997102-2'],
            ['Андреев В.С., Бутусов Д.Н., Хомицкая Е.С., Тутуева А.В.', 'Программно-аппаратный комплекс управления манипулятором SCORBOTER-III', 'Инженерные и научные приложения на базе технологий NI NIDAYS – 2015: Сборник трудов ХIV международной научно-практической конференции', 'Москва 27 ноября 2015 г. – М.: ДМК-пресс, 2015, с. 188-191', '', '', '', '', '', ''],
            ['Сольницев Р.И., Каримов А.И., Каримов Т.И., Бутусов Д.Н.', 'Проектирование цифровых регуляторов с применением дельта-оператора', 'Известия Санкт-Петербургского государственного электротехнического университета «ЛЭТИ»', '− 2015. − №9. c. 25-30', '1', '1', '', '', '', ''],
            ['Сольницев Р.И., Каримов А.И., Каримов Т.И., Бутусов Д.Н. Мкртычян А.Р., Якимовский Д.О.', 'Автоматизированное рабочее место проектировщика цифровых регуляторов командных приборов', 'Информационно-управляющие системы', '2015. № 6. С. 66–70', '1', '1', '', '', '10.15217/issn1684-8853.2015.6.66', ''],
        ]
    },
    {
        year: 2016,
        data: [
            ['Бутусов Д.Н., Каримов T.И., Тутуева А.В.', 'Аппаратно-ориентированные неявные численные методы решения дифференциальных уравнений', 'Фундаментальные исследования', '— 2016. — №2, ч.1, с. 22-27', '1', '1', '', '', '', ''],
            ['Каримов Т.И., Андреев В.С., Бутусов Д.Н.', ' Компьютерное моделирование цепей с электровакуумными приборами', 'Фундаментальные исследования', '— 2016. — №2, ч.1, с. 59-64', '1', '1', '', '', '', ''],
            ['Butusov D.N., Karimov T.I., Ostrovskii V.Y.', ' Semi-implicit ODE solver for matrix Riccati equation', '2016 IEEE NW Russia Young Researchers in Electrical and Electronic Engineering Conference (EIConRusNW)', 'Saint Petersburg, Russia, 2016, pp. 168-172', '', '', '000382668900043', '2-s2.0-84966551135', '10.1109/EIConRusNW.2016.7448146', '978-1-5090-0444-7'],
            ['Butusov D.N., Karimov A.I., Tutueva A.V.', 'Symmetric extrapolation solvers for ordinary differential equations', '2016 IEEE NW Russia Young Researchers in Electrical and Electronic Engineering Conference (EIConRusNW)', 'Saint Petersburg, Russia, 2016, pp. 162-167', '', '', '000382668900042', '2-s2.0-84966659115', '10.1109/EIConRusNW.2016.7448145', '978-1-5090-0444-7'],
            ['Karimov A.I., Karimov T.I., Butusov D.N.', 'Time-reversibility in chaotic problems numerical solution', '2016 IEEE NW Russia Young Researchers in Electrical and Electronic Engineering Conference (EIConRusNW)', 'Saint Petersburg, Russia, 2016, pp. 225-230', '', '', '000382668900057', '2-s2.0-84966565270', '10.1109/EIConRusNW.2016.7448160', '978-1-5090-0444-7'],
            ['Andreev V.S., Goryainov S.V., Krasilnikov A.V.', 'Six-body problem solution using symplectic integrators', '2016 IEEE NW Russia Young Researchers in Electrical and Electronic Engineering Conference (EIConRusNW)', 'Saint Petersburg, Russia, 2016, pp. 116-119', '', '', '000382668900032', '2-s2.0-84966600784', '10.1109/EIConRusNW.2016.7448135', '978-1-5090-0444-7'],
            ['Тутуева А.В., Красильников А.В., Горяинов С.В.', 'Экстраполяционный решатель нелинейных систем дифференциальных уравнений', '69-я Научно-техническая конференция профессорско-преподавательского состава университета: Сборник докладов студентов, аспирантов и молодых ученых', ' Санкт-Петербург, 26 января - 4 февраля 2016 г., Спб.: изд. СПБГЭТУ "ЛЭТИ". − 2016. с. 162-165', '', '', '', '', '', ''],
            ['Butusov D.N., Karimov A.I., Tutueva A.V.', 'Hardware-targeted Semi-implicit Extrapolation ODE Solvers', 'Proceedings of the 2016 International Siberian Conference on Control and Communications (SIBCON)', 'Moscow, Russia, 12-14 May, 2016', '', '', '000383090900090', '2-s2.0-84978066740', '10.1109/SIBCON.2016.7491741', '978-146738383-7'],
            ['Каримов Т.И., Бутусов Д.Н., Каримов А.И.', 'Компьютерное моделирование аудиосхем с вакуумными лампами', 'Сборник докладов XIX Международной конференции по мягким вычислениям и измерениям (SCM - 2016)', '25-27 мая 2016 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2016, с. 355–358.', '', '1', '', '', '', ''],
            ['Бутусов Д.Н., Андреев В.С., Пестерев Д.О.', 'Композиционные полунеявные методы моделирования хаотических систем', 'Сборник докладов XIX Международной конференции по мягким вычислениям и измерениям (SCM - 2016)', '25-27 мая 2016 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2016, с. 339–342.', '', '1', '', '', '', ''],
            ['Андреев В.С., Горяинов С.В. Красильников А.В.', 'Решение задачи N тел композиционными методами численного интегрирования', 'Сборник докладов XIX Международной конференции по мягким вычислениям и измерениям (SCM - 2016)', '25-27 мая 2016 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2016, с. 363–365', '', '1', '', '', '', ''],
            ['Коломойцев В.С., Красильников А.В., Бодров К.Ю.', 'Расчет вероятности обнаружения и устранения угроз безопасности информации в канале передачи данных', 'Сборник докладов XIX Международной конференции по мягким вычислениям и измерениям (SCM - 2016)', '25-27 мая 2016 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2016, с. 86–88', '', '1', '', '', '', ''],
            ['Butusov D.N., Tutueva A.V., Homitskaya E.S.', 'Extrapolation Semi-implicit ODE solvers with adaptive timestep', '2016 XIX IEEE International Conference on Soft Computing and Measurements (SCM)', 'St. Petersburg, Russia, 2016, pp. 137-140', '', '', '000383221200042', '2-s2.0-84992052779', '10.1109/SCM.2016.7519708', '978-1-4673-8919-8'],
            ['Karimov T.I., Butusov D.N., Karimov A.I.', 'Computer simulation of audio circuits with vacuum tubes', '2016 XIX IEEE International Conference on Soft Computing and Measurements (SCM)', 'St. Petersburg, Russia, 2016, pp. 114-116', '', '', '000383221200034', '2-s2.0-84992053085', '10.1109/SCM.2016.7519700', '978-1-4673-8919-8'],
            ['Butusov D.N., Andreev V.S., Pesterev D.O.', 'Composition semi-implicit methods for chaotic problems simulation', '2016 XIX IEEE International Conference on Soft Computing and Measurements (SCM)', 'St. Petersburg, Russia, 2016, pp. 107-110', '', '', '000383221200032', '2-s2.0-84992154499', '10.1109/SCM.2016.7519698', '978-1-4673-8919-8'],
            ['Andreev V.S., Goryainov S.V., Krasilnikov A.V.', 'N-body problem solution with composition numerical integration methods', '2016 XIX IEEE International Conference on Soft Computing and Measurements (SCM)', 'St. Petersburg, Russia, 2016, pp. 196-198', '', '', '000383221200060', '2-s2.0-84992034554', '10.1109/SCM.2016.7519726', '978-1-4673-8919-8'],
            ['Kolomoitcev V.S., Bodrov K.U., Krasilnikov A.V.', 'Calculating the probability of detection and removal of threats to information security in data channels', '2016 XIX IEEE International Conference on Soft Computing and Measurements (SCM)', 'St. Petersburg, Russia, 2016, pp. 25-27', '', '', '000383221200007', '2-s2.0-84992109071', '10.1109/SCM.2016.7519672', '978-1-4673-8919-8'],
            ['Ostrovskii V.Y., Butusov D.N., Toepfer H.', 'Application of the Semi-Implicit Numerical Integration Methods for the Simulation of Memristor-Based Circuits', 'Proceedings of the International Academic Forum AMO - SPITSE - NESEFF', '20.-25.06.2016, Moscow / Smolensk, Russia, pages 44-46, 2016', '', '', '', '', '', ''],
            ['Каримов Т.И., Белкин Д.А., Топорская А.С., Севастьянова Т.С.', 'Система сбора биометрических данных пчелиного улья', 'Сборник трудов XV международной конференции NIDays 2016', 'Москва 25 ноября 2016 г.– М.: ДМК-пресс, 2016. с 102-104.', '', '', '', '', '', ''],
            ['Пестерев Д.О., Бутусов Д.Н.', 'Моделирование и анализ хаотических нейронных сетей', 'Сборник трудов XV международной конференции NIDays 2016', 'Москва 25 ноября 2016 г.– М.: ДМК-пресс, 2016. с 38-40.', '', '', '', '', '', ''],
            ['Каримов А.И., Лизунова И.А., Солдаткина А.А., Попова Е.Н., Бертыш В.А.', 'Система автоматизации исследования хаотических цепей', 'Сборник трудов XV международной конференции NIDays 2016', 'Москва 25 ноября 2016 г.– М.: ДМК-пресс, 2016. с 435-437.', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Андреев В.С., Каримов А.И.', 'Генераторы хаотических сигналов на основе полуявных алгоритмов численного интегрирования', 'Наука и образование: технология успеха: сб. докл. Международной научной конференции.', ' СПб.: Изд-во СПбГЭТУ «ЛЭТИ», 2016. С. 147-152', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Каримов А.И., Каримов Т.И.', 'Аппаратно-ориентированные численные методы интегрирования.', 'Монография', ' СПб.: Изд-во СПбГЭТУ «ЛЭТИ», 2016, 192 С.', '', '', '', '', '', ''],
            ['Каримов А.И., Островский В.Ю., Бутусов Д.Н.', 'Теоретические и практические аспекты машинной живописи', 'Программные системы и вычислительные методы', 'М.: НБ-Медиа. с.403-414, 2016', '1', '1', '', '', '10.7256/2305-6061.2016.4.21188', ''],
        ]
    },
    {
        year: 2017,
        data: [
            ['Andreev V.S., Goryainov S.V., Krasilnikov A.V., Sarma K.K.', 'Scaling Techniques for Fixed-Point Chaos Generators', 'Proceedings of the 2017 IEEE Russia Section Young Researchers in Electrical and Electronic Engineering Conference (2017 ElConRus)', 'Saint Petersburg, Russia, February 1-3, 2017', '', '', '000403395600065', '2-s2.0-85019430977', '10.1109/EIConRus.2017.7910542', '978-1-5090-4865-6'],
            ['Butusov D.N., Karimov T.I., Lizunova I.A., Soldatkina A.A., Popova E.N.', 'Synchronization of Analog and Discrete Rössler Chaotic Systems', 'Proceedings of the 2017 IEEE Russia Section Young Researchers in Electrical and Electronic Engineering Conference (2017 ElConRus)', 'Saint Petersburg, Russia, February 1-3, 2017', '', '', '000403395600067', '2-s2.0-85019407601', '10.1109/EIConRus.2017.7910544', '978-1-5090-4865-6'],
            ['Butusov D.N., Ostrovskii V.Y., Pesterev D.O.', 'Numerical Analysis of Memristor-Based Circuits with Semi-Implicit Methods', 'Proceedings of the 2017 IEEE Russia Section Young Researchers in Electrical and Electronic Engineering Conference (2017 ElConRus)', 'Saint Petersburg, Russia, February 1-3, 2017', '', '', '000403395600068', '2-s2.0-85019478128', '10.1109/EIConRus.2017.7910545', '978-1-5090-4865-6'],
            ['Karimov A.I., Butusov D.N., Tutueva A.V.', 'Adaptive Explicit-Implicit Switching Solver for Stiff ODEs.', ' Proceedings of the 2017 IEEE Russia Section Young Researchers in Electrical and Electronic Engineering Conference (2017 ElConRus)', 'Saint Petersburg, Russia, February 1-3, 2017', '', '', '000403395600108', '2-s2.0-85019419292', '10.1109/EIConRus.2017.7910586', '978-1-5090-4865-6'],
            ['Сольницев Р.И., Каримов А.И., Каримов Т.И.', 'Синтез цифровых регуляторов гироскопических командных приборов', 'Гироскопия и навигация', 'Том 25, № 1 (96), 2017. С. 108-118', '', '', '', '', '10.17285/0869-7035.2017.25.1.108-118', ''],
            ['Butusov D.N., Karimov T.I., Kaplun D.I., Karimov A.I., Huang Y., Li Szu-Chuang', 'The Choice between Delta and Shift Operators for Low-Precision Data Representation', 'Proceeding of the 20th conference of FRUCT association', 'Saint-Petersburg, Russia, 3-7 April 2017,  № 8071291, pp. 46-52', '', '', '', '2-s2.0-85037815420', '10.23919/FRUCT.2017.8071291', '978-1-5090-6487-8'],
            ['Горяинов С.В., Белкин Д.А., Бутусов Д.Н., Рыбин В.Г., Савельев А.О.', 'Композиционные решатели обыкновенных дифференциальных уравнений в среде LABVIEW', 'Сборник трудов конференции NI Academic Days 2017', 'Москва 13-14 апреля 2017 г, c. 123-126', '', '', '', '', '', ''],
            ['Каримов А.И., Бутусов Д.Н., Белкин Д.А., Шаталов П.С., Солдаева А.А.', 'Адаптивный экстраполяционный решатель дифференциальных уравнений для среды LABVIEW', 'Сборник трудов конференции NI Academic Days 2017', 'Москва 13-14 апреля 2017 г., c.90-96', '', '', '', '', '', ''],
            ['Филимонов О.А., Севастьянова Т.С., Топорская А.С., Белкин Д.А., Рыбин В.Г.', 'Система сбора данных о состоянии пчелиного улья', '70-я Научно-техническая конференция профессорско-преподавательского состава университета: Сборник докладов студентов, аспирантов и молодых ученых', 'Санкт-Петербург, 1 - 11 февраля 2017 г., Спб.: изд. СПБГЭТУ "ЛЭТИ". − 2017. с. 147-150', '', '', '', '', '', ''],
            ['Бутусов Д.Н., Островский В.Ю., Тутуева А.В., Савельев А.О.', 'Сравнение алгоритмов мультипараметрического бифуркационного анализа', 'Сборник докладов XX Международной конференции по мягким вычислениям и измерениям (SCM - 2017)', '24-26 мая 2017 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2017, с. 397-400', '', '1', '', '', '', ''],
            ['Каримов А.И., Бутусов Д.Н., Рыбин В.Г., Каримов Т.И.', 'Исследование модифицированного отображения Чирикова', 'Сборник докладов XX Международной конференции по мягким вычислениям и измерениям (SCM - 2017)', '24-26 мая 2017 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2017, с. 401-404', '', '1', '', '', '', ''],
            ['Андреев В.С., Горяинов С.В., Островский В.Ю., Белкин Д.А.', 'Алгоритмы управления шагом интегрирования композиционных решателей ОДУ', 'Сборник докладов XX Международной конференции по мягким вычислениям и измерениям (SCM - 2017)', '24-26 мая 2017 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2017, с. 449-452', '', '1', '', '', '', ''],
            ['Белкин Д.А., Красильников А.В., Пестерев Д.О., Каримов Т.И.', 'Влияние возмущений в тракте передачи синхросигнала на погрешность синхронизации динамических систем', 'Сборник докладов XX Международной конференции по мягким вычислениям и измерениям (SCM - 2017)', '24-26 мая 2017 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2017, с.453-456', '', '1', '', '', '', ''],
            ['Красильников А.В., Кузнецов А.Ю., Тушканов Е.В., Кузнецова О.В., Романова Е.Б.', 'Метод распознавания маскировочного покрытия на видеоспектральных снимках по критерию Неймана–Пирсона', 'Сборник докладов XX Международной конференции по мягким вычислениям и измерениям (SCM - 2017)', '24-26 мая 2017 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2017, с.97-99', '', '1', '', '', '', ''],
            ['Горяинов С.В., Кузнецов А.Ю., Тушканов Е.В., Кузнецова О.В., Романова Е.Б.', 'Анализ байесовских математических систем распознавания образов для идентификации объектов на гиперспектральных снимках', 'Сборник докладов XX Международной конференции по мягким вычислениям и измерениям (SCM - 2017)', ' 24-26 мая 2017 г. СПб. Изд. СПбГЭТУ «ЛЭТИ», 2017, с.69-72', '', '1', '', '', '', ''],
            ['Butusov D.N., Karimov T.I., Kaplun D.I, Karimov A.I.', ' Delta Operator Filter Design for Hydroacoustic Tasks', 'Proceedings - Research Monograph of the 6th Mediterranean Conference on Embedded Computing (MECO) including 5th EUROMICRO/IEEE Workshop on Embedded and Cyber-Physical Systems (ECYPS’2017)', 'Bar, Montenegro, June 11-16, 2017, pp. 263-266', '', '', '', '2-s2.0-85027069612', '10.1109/MECO.2017.7977213', '978-1-5090-6741-1'],
            ['Butusov D.N., Ostrovskii V.Y., Tutueva A.V., Savelev A.O.', 'Comparing the algorithms of multiparametric bifurcation analysis', 'XX IEEE International Conference on Soft Computing and Measurements (SCM - 2017)', 'Saint Petersburg, Russia, May 24-26, 2017, pp. 194-198', '', '', '', '2-s2.0-85027185175', '10.1109/SCM.2017.7970536', '978-1-5386-1810-3'],
            ['Karimov A.I., Butusov D.N., Rybin V.G., Karimov T.I.', 'The study of the modified Chirikov map', 'XX IEEE International Conference on Soft Computing and Measurements (SCM - 2017)', 'Saint Petersburg, Russia, May 24-26, 2017, pp. 341-344', '', '', '', '2-s2.0-85027144734', '10.1109/SCM.2017.7970579', '978-1-5386-1810-3'],
            ['Andreev V.S., Goryainov S.V., Ostrovskii V.Y., Belkin D.A.', 'Stepize control algorithms for composition ODE solvers', 'XX IEEE International Conference on Soft Computing and Measurements (SCM - 2017)', 'Saint Petersburg, Russia, 2017, pp. 337-340', '', '', '', '2-s2.0-85027133326', '10.1109/SCM.2017.7970578', '978-1-5386-1810-3'],
            ['Belkin D.A., Krasilnikov A.V., Pesterev D.O., Karimov T.I.', 'Influence of disturbances in sync signal path on dynamical systems synchronization', 'XX IEEE International Conference on Soft Computing and Measurements (SCM - 2017)', 'Saint Petersburg, Russia, May 24-26, 2017, pp. 145-147', '', '', '', '2-s2.0-85027135340', '10.1109/SCM.2017.7970521', '978-1-5386-1810-3'],
            ['Goryainov S.V., Kuznetsov A.Y., Tushkanov E.V., Kuznetsova O.V., Romanova E.B.', 'Analysis of Bayes mathematical systems of pattern recognition for identifying the objects on hyperspectral photographs', 'XX IEEE International Conference on Soft Computing and Measurements (SCM - 2017)', 'Saint Petersburg, Russia, May 24-26, 2017, pp. 40-42', '', '', '', '2-s2.0-85027175222', '10.1109/SCM.2017.7970489', '978-1-5386-1810-3'],
            ['Krasilnikov A.V., Kuznetsov A.Y., Tushkanov E.V., Kuznetsova O.V., Romanova E.B.', 'Method of detection the prevent coating on hyperspectral representation by Neumann-Pearson criterion', 'XX IEEE International Conference on Soft Computing and Measurements (SCM - 2017)', 'Saint Petersburg, Russia, May 24-26, 2017, pp. 64-66', '', '', '', '2-s2.0-85027142170', '10.1109/SCM.2017.7970496', '978-1-5386-1810-3'],
            ['Копец Е.Е., Рыбин В.Г.', 'Система сбора биометрических данных пчелиного улья', 'Наука настоящего и будущего', 'СПб.: Изд-во СПбГЭТУ «ЛЭТИ», 2017, том 1., с. 66-67', '', '', '', '', '', ''],
            ['Bagirova A. P., Notman O. V., Bagirov A. D., Goryainov S. V.', 'Subjective wellbeing of residents as an indicator of the social parthnership effectiveness in urban governance', '2017 International Conference «Quality Management, Transport and Information Security, Information Technologies» (IT&QM&IS)', 'Saint Petersburg, Russia, September 24-30, 2017, pp. 4-7', '', '', '', '', '10.1109/ITMQIS.2017.8085747', '978-1-5386-0703-9'],
            ['Tutueva A. V., Butusov D. N., Pesterev D. O., Belkin D. A., Ryzhov N. G.', 'Novel normalization technique for chaotic pseudo-random number generators based on semi-implicit ODE solvers', '2017 International Conference «Quality Management, Transport and Information Security, Information Technologies» (IT&QM&IS)', 'Saint Petersburg, Russia, September 24-30, 2017, pp. 284-287', '', '', '', '2-s2.0-85040129353', '10.1109/ITMQIS.2017.8085814', '978-1-5386-0703-9'],
            ['Karimov A. I., Pesterev D. O., Ostrovskii V. Y., Butusov D. N., Kopets E. E.', 'Brushstroke renedering algorithm for a painting robot', '2017 International Conference «Quality Management, Transport and Information Security, Information Technologies» (IT&QM&IS)', 'Saint Petersburg, Russia, September 24-30, 2017, pp. 323-326', '', '', '', '2-s2.0-85040101645', '10.1109/ITMQIS.2017.8085826', '978-1-5386-0703-9'],
            ['Синица А.М., Гульванский В.В., Каплун Д.И., Канатов И.И., Бутусов Д.Н.', 'Осциллограф RTB_2000', 'Электронные компоненты', ' – 2017. – №6', '', '', '', '', '', ''],
            ['Рыбин В.Г., Бутусов Д.Н., Горяинов С.В., Кобызев Н.П.', 'Проектирование распределенных систем сбора биологических данных', 'Сборник научных трудов I Международной научно-практической конференции', 'Брянск, 22-23 ноября 2017, с. 64-68', '', '', '', '', '', '978-5-906967-76-3'],
            ['Горяинов С.В., Мартынов В.Ю., Бутусов Д.Н., Фахми Ш.С.', 'Подходы к оценке симметричности конечно-разностных моделей нелинейных динамических системы', 'Сборник научных трудов I Международной научно-практической конференции', 'Брянск, 22-23 ноября 2017, с.152-157', '', '', '', '', '', '978-5-906967-76-3'],
        ]
    }
];

/**
 * Получить массив имен авторов из строки
 * @param {Строка авторов 'Иван И.И., Петров М.М.'} strAuthors 
 */
let createArrAuthorNamesByStr = function (strAuthors) {
    let arrStrsAuthors = strAuthors.split(', ');
    let arrAuthors = [];
    for (let i = 0; i < arrStrsAuthors.length; i++) {
        arrAuthors.push(createAuthorNameByStr(arrStrsAuthors[i]));
    }

    return arrAuthors;
};

/**
 * Создать имя автора из строки
 * @param {Автор представленный строкой 'Иван И.И.'} strAuthor 
 */
let createAuthorNameByStr = function (strAuthor) {
    let author = {};
    author.lang = GetLang.getLangByStr(strAuthor);

    let indexSpace = strAuthor.indexOf(' ');
    author.lastname = strAuthor.slice(0, indexSpace);
    let indexDot = strAuthor.indexOf('.');
    author.firstname = strAuthor.slice(indexSpace + 1, indexDot);
    if (indexDot + 1 != strAuthor.length) {
        author.patronymic = strAuthor.slice(indexDot + 1);
        indexDot = author.patronymic.indexOf('.');
        if (indexDot != -1) {
            author.patronymic = author.patronymic.slice(0, indexDot);
        }
    }

    return author;
};

/**
 * Найти id автора по имени
 * @param {Объект имени} nameObj 
 */
let findAuthorIdByNameObj = async function (nameObj) {
    let params = {
        lastname: nameObj.lastname,
        firstname: { startsWith: nameObj.firstname }
    }
    if (nameObj.patronymic != undefined) {
        params.patronymic = { startsWith: nameObj.patronymic };
    }
    let name = await Name.findOne(params);
    if (name != undefined) {
        return name.author
    }
    return null;
};

let createObjPublication = async function (data, year, editor, authors) {
    // Формирование объекта публикации
    let title = await PublicationTitle.create({
        lang: GetLang.getLangByStr(data[1]),
        title: data[1]
    });
    let pub = {
        country: GetLang.getLangByStr(data[1]),
        type: 1,
        datepub: year,
        titles: [title.id],
        is_vak: data[4] != '' ? 1 : 0,
        is_rince: data[5] != '' ? 1 : 0,
        wos: data[6],
        scopus_id: data[7],
        doi: data[8],
        isbn: data[9],
        dataout: data[3],
        editor: editor,
        authors: authors
    };
    console.log(pub);
    return pub;
}

/**
 * Получить массив авторов, либо id автора, который уже существует, либо объект для создания нового автора
 * @param {Строка авторов} strAuthors 
 */
let getAuthors = async function (strAuthors) {
    let authors = [];
    let arrNames = createArrAuthorNamesByStr(strAuthors);
    let newAuthors = [];

    for (let i = 0; i < arrNames.length; i++) {
        let author = await findAuthorIdByNameObj(arrNames[i]);
        if (author != null) {
            authors.push(author);
        } else {
            author = await Author.create({ names: [arrNames[i]] });
            authors.push(author.id);
        }
    }

    return authors;
};

let getEditor = async function (title) {
    let nameEditor = await EditorName.findOne({ name: title });
    if (nameEditor != undefined) {
        return nameEditor.editor;
    }

    let editor = await Editor.create({
        titles: {
            lang: GetLang.getLangByStr(title),
            name: title
        }
    });

    return editor.id;
}

exports.add = async function () {
    console.log('Added default publications');
    let newPublications = [];

    for (let i = 0; i < data.length; i++) {

        let year = data[i].year;
        for (let j = 0; j < data[i].data.length; j++) {
            let strParamsPublication = data[i].data[j];

            // Проверка существования публикации
            let publicationTitle = await PublicationTitle.findOne({ title: strParamsPublication[1] });
            if (publicationTitle != undefined) {
                continue;
            }

            let pub = await createObjPublication(
                strParamsPublication,
                year,
                await getEditor(strParamsPublication[2]),
                await getAuthors(strParamsPublication[0])
            );
            //newPublications.push(pub);
            console.log(pub);
            await Publication.create(pub);
        }
    }

    /* console.log(newPublications);
    await Publication.createEach(newPublications); */

    console.log('end');
    console.log();
    return;
};